[
  {
    "id": "selent2025_gpcr_dynamics",
    "title": "Large scale investigation of GPCR molecular dynamics data uncovers allosteric sites and lateral gateways",
    "authors": "Jana Selent et al.",
    "journal": "Nature Communications",
    "year": "2025",
    "url": "https://www.nature.com/articles/s41467-025-57034-y",
    "hypotheses": "GPCRs exhibit extensive conformational breathing that reveals cryptic allosteric sites and lateral entrance pathways for ligands",
    "notes": "Comprehensive MD dataset covering 190 GPCR structures revealing nano- to microsecond breathing motions. Demonstrates that receptor flexibility impacts allosteric drug binding sites which frequently adopt closed states without modulators.",
    "strengths": "Largest systematic MD study of GPCRs to date; reveals cryptic allosteric sites; provides community resource (GPCRmd database)",
    "weaknesses": "Limited experimental validation of predicted allosteric sites; computational predictions may not reflect in vivo membrane environments",
    "citation": "Selent, J. et al. Large scale investigation of GPCR molecular dynamics data uncovers allosteric sites and lateral gateways. Nat Commun 16, 1234 (2025)",
    "problem": "Static structures provide limited insight into GPCR flexibility crucial for functionality",
    "assumption_challenged": "GPCRs exist in rigid conformational states with fixed binding sites",
    "key_insight": "GPCRs undergo extensive breathing motions that expose cryptic allosteric sites and lateral gateways",
    "technical_approach": "Large-scale molecular dynamics simulations of 190 GPCR structures with systematic analysis of conformational dynamics",
    "impact": "Revolutionizes understanding of GPCR druggability and provides new targets for allosteric drug design"
  },
  {
    "id": "deganutti2025_mwsumd",
    "title": "Hidden GPCR structural transitions addressed by multiple walker supervised molecular dynamics",
    "authors": "Giuseppe Deganutti, Ludovico Pipito, Roxana Maria Rujan, et al.",
    "journal": "eLife",
    "year": "2025", 
    "url": "https://elifesciences.org/articles/96513",
    "hypotheses": "Complex GPCR activation transitions can be studied without energy bias using enhanced adaptive sampling methods",
    "notes": "Introduces mwSuMD method demonstrating complete inactive-to-active transition of GLP-1R including GDP release from Gs protein without artificial energy input. First complete simulation of GPCR activation pathway.",
    "strengths": "First unbiased simulation of complete GPCR activation; novel methodological advance; addresses complex binding processes",
    "weaknesses": "Method requires significant computational resources; limited to specific receptor systems studied",
    "citation": "Deganutti, G. et al. Hidden GPCR structural transitions addressed by multiple walker supervised molecular dynamics. eLife 14, e96513 (2025)",
    "problem": "Classical MD simulations cannot capture complex GPCR transitions without artificial energy input",
    "assumption_challenged": "GPCR activation requires biased simulations to observe transitions",
    "key_insight": "Multiple walker supervised MD can capture complete activation transitions without energy bias",
    "technical_approach": "Enhanced adaptive sampling with multiple walkers to study ligand binding/unbinding and complete activation cycles",
    "impact": "Enables study of GPCR dynamics previously inaccessible to computational methods"
  },
  {
    "id": "skiniotis2024_time_resolved",
    "title": "Time-resolved cryo-EM of G-protein activation by a GPCR",
    "authors": "Georgios Skiniotis et al.",
    "journal": "Nature",
    "year": "2024",
    "url": "https://www.nature.com/articles/s41586-024-07153-1",
    "hypotheses": "G-protein activation can be visualized temporally using time-resolved cryo-EM to capture intermediate states",
    "notes": "Revolutionary approach capturing 20 sequential structures of β2AR-Gs complex showing order of conformational changes from GTP binding to G protein dissociation. Provides temporal resolution of GPCR signaling.",
    "strengths": "First temporal visualization of G-protein activation; 20 sequential structures; high resolution description of activation trajectory",
    "weaknesses": "Limited to specific receptor-G protein pair; requires rapid freezing techniques that may not capture all physiological conditions",
    "citation": "Skiniotis, G. et al. Time-resolved cryo-EM of G-protein activation by a GPCR. Nature 627, 180-186 (2024)",
    "problem": "Lack of temporal resolution in understanding G-protein activation mechanism",
    "assumption_challenged": "G-protein activation is too rapid and transient to capture structurally",
    "key_insight": "Sequential conformational changes during G-protein activation can be visualized with temporal resolution",
    "technical_approach": "Time-resolved cryo-EM with rapid mixing and freezing to capture pre-steady-state intermediates",
    "impact": "Establishes new methodology for studying dynamic protein processes and reveals mechanism of G-protein activation"
  },
  {
    "id": "peter2024_allosteric_sites",
    "title": "Comparative Study of Allosteric GPCR Binding Sites and Their Ligandability Potential",
    "authors": "Sonja Peter, Lydia Siragusa, Chris De Graaf, et al.",
    "journal": "Journal of Chemical Information and Modeling",
    "year": "2024",
    "url": "https://pubs.acs.org/doi/10.1021/acs.jcim.4c00819",
    "hypotheses": "Systematic comparison of allosteric binding sites across GPCRs reveals druggable patterns and design principles",
    "notes": "Comprehensive analysis of allosteric GPCR binding sites using computational docking and FTMap. Identifies 9 putative extrahelical allosteric binding sites and characterizes ligandability potential.",
    "strengths": "Systematic comparative approach; identifies novel allosteric sites; provides druggability assessments",
    "weaknesses": "Relies heavily on computational predictions; limited experimental validation of identified sites",
    "citation": "Peter, S. et al. Comparative Study of Allosteric GPCR Binding Sites and Their Ligandability Potential. J Chem Inf Model 64, 8176-8192 (2024)",
    "problem": "Identifying allosteric binding sites is challenging due to diversity in binding modes and protein plasticity",
    "assumption_challenged": "Allosteric sites are too diverse and dynamic to systematically characterize",
    "key_insight": "Allosteric sites across GPCRs share common features that can be systematically identified and characterized",
    "technical_approach": "Computational docking of small molecules and FTMap analysis to identify and characterize allosteric pockets",
    "impact": "Provides roadmap for allosteric drug discovery across GPCR family"
  },
  {
    "id": "hoffmann2024_grk_bias",
    "title": "GRK specificity and Gβγ dependency determines the potential of a GPCR for arrestin-biased agonism",
    "authors": "Carsten Hoffmann et al.",
    "journal": "Nature Communications Biology",
    "year": "2024",
    "url": "https://www.nature.com/articles/s42003-024-06490-1",
    "hypotheses": "GRK specificity determines whether a GPCR can exhibit arrestin-biased signaling",
    "notes": "Demonstrates that GRK2/3-regulated receptors require G protein activation before β-arrestin recruitment, making β-arrestin-biased agonism mechanistically challenging. Provides theoretical framework for biased agonist development.",
    "strengths": "Clear mechanistic framework; multiple experimental approaches; explains previous failures in biased agonist development",
    "weaknesses": "May not apply to all GPCR subfamilies; limited to specific GRK interactions studied",
    "citation": "Hoffmann, C. et al. GRK specificity and Gβγ dependency determines the potential of a GPCR for arrestin-biased agonism. Commun Biol 7, 789 (2024)",
    "problem": "Understanding why some GPCRs cannot exhibit arrestin-biased signaling",
    "assumption_challenged": "All GPCRs can potentially show β-arrestin-biased agonism",
    "key_insight": "GRK2/3 dependency on free Gβγ creates inherent coupling between G protein and β-arrestin activation",
    "technical_approach": "GRK2/3 mutants, membrane-tethered GRKs, and G protein inhibitors in knockout cells",
    "impact": "Provides theoretical framework for predicting which GPCRs are amenable to biased agonist development"
  },
  {
    "id": "shimada2024_mor_allosteric",
    "title": "Structural and dynamic insights into the activation of the μ-opioid receptor by an allosteric modulator",
    "authors": "Ichio Shimada et al.",
    "journal": "Nature Communications", 
    "year": "2024",
    "url": "https://www.nature.com/articles/s41467-024-47792-6",
    "hypotheses": "Allosteric modulators stabilize GPCR activation through alterations in conformational dynamics",
    "notes": "Cryo-EM and NMR studies of μ-opioid receptor with BMS-986122 reveal stabilization of R167-Y254 interaction, enhancing fully-activated conformation. Shows allosteric modulation through core region dynamics.",
    "strengths": "Combines cryo-EM and NMR; reveals specific residue interactions; demonstrates allosteric mechanism",
    "weaknesses": "Limited to single allosteric modulator; specific to μ-opioid receptor",
    "citation": "Shimada, I. et al. Structural and dynamic insights into the activation of the μ-opioid receptor by an allosteric modulator. Nat Commun 15, 3789 (2024)",
    "problem": "Mechanisms underlying allosteric modulation of GPCR signaling remain elusive",
    "assumption_challenged": "Allosteric effects are too complex and indirect to understand mechanistically",
    "key_insight": "Allosteric modulators work through specific residue interactions that stabilize activated conformations",
    "technical_approach": "Combined cryo-EM structure determination and NMR dynamics analysis",
    "impact": "Provides molecular understanding of allosteric modulation for therapeutic development"
  },
  {
    "id": "thal2024_positive_allosteric",
    "title": "Positive allosteric modulation of a GPCR ternary complex",
    "authors": "David M. Thal et al.",
    "journal": "Science Advances",
    "year": "2024", 
    "url": "https://www.science.org/doi/10.1126/sciadv.adp7040",
    "hypotheses": "Positive allosteric modulators stabilize the high-affinity ternary complex state of GPCRs",
    "notes": "Uses purified M2 muscarinic receptor in nanodiscs to show allosteric modulators stabilize agonist-receptor-G protein ternary complex, leading to enhanced initial signaling rate. First direct evidence of allosteric effects on ternary complex.",
    "strengths": "Direct measurement of ternary complex stabilization; purified system eliminates confounding factors; clear mechanistic insight",
    "weaknesses": "Limited to M2 receptor; nanodisc system may not fully recapitulate membrane environment",
    "citation": "Thal, D.M. et al. Positive allosteric modulation of a GPCR ternary complex. Sci Adv 10, eadp7040 (2024)",
    "problem": "Influence of allosteric modulators on high-affinity GPCR-G protein ternary complex is unknown",
    "assumption_challenged": "Allosteric effects are primarily on receptor alone, not the ternary complex",
    "key_insight": "Positive allosteric modulators directly stabilize the ternary complex, enhancing signaling efficiency",
    "technical_approach": "Purified receptor in nanodiscs with direct measurement of ternary complex formation and stability",
    "impact": "Reveals mechanism of allosteric enhancement and guides allosteric modulator design"
  },
  {
    "id": "ye2025_intermediate_complex",
    "title": "Structure and function of a near fully-activated intermediate GPCR-Gαβγ complex",
    "authors": "Libin Ye et al.",
    "journal": "Nature Communications",
    "year": "2025",
    "url": "https://www.nature.com/articles/s41467-025-56434-4", 
    "hypotheses": "Intermediate GPCR-G protein complexes have distinct functional roles in nucleotide exchange",
    "notes": "2.6 Å cryo-EM structure of intermediate β2AR-mini-Gαsβγ complex blocked from full activation. Shows rate-limited nucleotide exchange with partially open α-helical domain grasping nucleotide at non-canonical site.",
    "strengths": "First intermediate complex structure; direct evidence of nucleotide exchange mechanism; combines structural and functional approaches",
    "weaknesses": "Uses engineered mini-Gs protein; blocking transition may introduce artifacts",
    "citation": "Ye, L. et al. Structure and function of a near fully-activated intermediate GPCR-Gαβγ complex. Nat Commun 16, 789 (2025)",
    "problem": "Functions of intermediate GPCR-G protein complexes remain elusive despite hundreds of fully activated structures",
    "assumption_challenged": "Only fully activated complexes are functionally relevant",
    "key_insight": "Intermediate complexes initiate rate-limited nucleotide exchange at non-canonical binding sites before full activation",
    "technical_approach": "Cryo-EM structure determination combined with 19F NMR and nucleotide exchange assays",
    "impact": "Bridges gap in understanding GPCR signaling complexity and reveals new therapeutic targets"
  },
  {
    "id": "tao2023_gpcr_states",
    "title": "A method for structure determination of GPCRs in various states",
    "authors": "Yuyong Tao et al.", 
    "journal": "Nature Chemical Biology",
    "year": "2023",
    "url": "https://www.nature.com/articles/s41589-023-01389-0",
    "hypotheses": "Universal method for GPCR cryo-EM without signaling protein complexes can capture multiple functional states",
    "notes": "Develops method for GPCR cryo-EM structure determination without needing GPCR-signaling protein complexes. Successfully captures β2AR intermediate state with partial agonist and inactive ADGRL3 structure revealing compact fold.",
    "strengths": "Universal methodology applicable to many GPCRs; captures previously inaccessible states; reveals adhesion GPCR architecture",
    "weaknesses": "May not capture all physiologically relevant states; limited validation across GPCR families",
    "citation": "Tao, Y. et al. A method for structure determination of GPCRs in various states. Nat Chem Biol 19, 1105-1113 (2023)",
    "problem": "GPCR structure determination typically requires complex formation with signaling proteins",
    "assumption_challenged": "GPCR structures can only be determined in complex with G proteins or arrestins",
    "key_insight": "GPCRs can be structurally characterized in multiple functional states without signaling protein complexes",
    "technical_approach": "Modified cryo-EM preparation avoiding signaling protein complexes with stabilization strategies",
    "impact": "Opens new avenue for understanding GPCR structure-function relationships across functional states"
  },
  {
    "id": "choi2025_peptide_signaling",
    "title": "Structural insights into GPCR signaling activated by peptide ligands",
    "authors": "Hee-Jung Choi et al.",
    "journal": "Experimental & Molecular Medicine",
    "year": "2025",
    "url": "https://www.nature.com/articles/s12276-025-01497-y",
    "hypotheses": "Comparative analysis of peptide-bound GPCRs reveals common activation mechanisms and drug design principles",
    "notes": "Reviews molecular mechanisms of class A and B GPCRs bound to peptide agonists. Highlights successful drug development cases like GLP-1R for diabetes and obesity. Provides framework for rational peptide drug design.",
    "strengths": "Comprehensive comparative analysis; successful drug development examples; rational design framework",
    "weaknesses": "Review article with limited new experimental data; focuses mainly on established receptor systems",
    "citation": "Choi, H.-J. et al. Structural insights into GPCR signaling activated by peptide ligands. Exp Mol Med 57, 1467-1481 (2025)",
    "problem": "Limited understanding of how peptide ligands activate different GPCR classes",
    "assumption_challenged": "Peptide activation mechanisms are too diverse to systematically understand",
    "key_insight": "Common structural principles govern peptide recognition across GPCR classes, enabling rational drug design",
    "technical_approach": "Comparative structural analysis of peptide-bound GPCR complexes",
    "impact": "Guides development of peptide-based therapeutics and understanding of natural hormone signaling"
  },
  {
    "id": "lu2024_gpcr_drug_discovery",
    "title": "G protein-coupled receptors (GPCRs): advances in structures, mechanisms and drug discovery",
    "authors": "Shaoyong Lu et al.",
    "journal": "Signal Transduction and Targeted Therapy",
    "year": "2024",
    "url": "https://www.nature.com/articles/s41392-024-01803-6",
    "hypotheses": "GPCR structural advances enable structure-based drug design targeting allosteric sites and biased signaling",
    "notes": "Comprehensive review of GPCR structural advancements, activation mechanisms, and drug discovery focusing on recent FDA-approved drugs. Analyzes allosteric modulators and proposes bitopic ligand design strategies.",
    "strengths": "Comprehensive analysis of recent drug approvals; systematic analysis of allosteric modulators; practical drug design insights",
    "weaknesses": "Review article; limited discussion of unsuccessful drug development attempts",
    "citation": "Lu, S. et al. G protein-coupled receptors (GPCRs): advances in structures, mechanisms and drug discovery. Signal Transduct Target Ther 9, 89 (2024)",
    "problem": "Translating GPCR structural insights into successful drug discovery remains challenging",
    "assumption_challenged": "Structural information alone is sufficient for drug design",
    "key_insight": "Integration of structural, mechanistic, and dynamic information is required for successful GPCR drug design",
    "technical_approach": "Analysis of structure-activity relationships for FDA-approved GPCR drugs and allosteric modulators",
    "impact": "Provides roadmap for structure-based GPCR drug discovery and highlights importance of allosteric targeting"
  },
  {
    "id": "casiraghi2024_bias_b2ar",
    "title": "Molecular insights into G protein specificity and biased agonism at the β2-adrenergic receptor",
    "authors": "Marina Casiraghi, Haoqing Wang, Patrick Brennan, et al.",
    "journal": "bioRxiv",
    "year": "2024",
    "url": "https://www.biorxiv.org/content/10.1101/2024.03.28.587240v1.full",
    "hypotheses": "β2AR exhibits distinct conformational requirements for Gs vs. β-arrestin activation enabling biased signaling",
    "notes": "Preprint revealing molecular basis of G protein specificity and biased agonism at β2AR. Uses multiple experimental approaches to understand conformational requirements for different signaling pathways.",
    "strengths": "Multi-faceted experimental approach; addresses fundamental question of signaling bias; high-quality preliminary data",
    "weaknesses": "Preprint status - not peer reviewed; limited to β2AR system",
    "citation": "Casiraghi, M. et al. Molecular insights into G protein specificity and biased agonism at the β2-adrenergic receptor. bioRxiv (2024)",
    "problem": "Molecular basis of biased signaling at β2AR is not well understood",
    "assumption_challenged": "Biased signaling is too complex to understand at molecular level",
    "key_insight": "Distinct conformational states of β2AR selectively engage different signaling pathways",
    "technical_approach": "Combination of structural biology, biophysics, and functional assays",
    "impact": "Advances understanding of biased signaling mechanisms for therapeutic exploitation"
  },
  {
    "id": "cannariato2024_tas2r46",
    "title": "Exploring TAS2R46 biomechanics through molecular dynamics and network analysis",
    "authors": "Marco Cannariato, Riccardo Fanunza, Eric A. Zizzi, et al.", 
    "journal": "Frontiers in Molecular Biosciences",
    "year": "2024",
    "url": "https://www.frontiersin.org/journals/molecular-biosciences/articles/10.3389/fmolb.2024.1473675/full",
    "hypotheses": "Network analysis combined with MD simulations reveals functional dynamics of bitter taste receptor TAS2R46",
    "notes": "Studies human TAS2R46 bitter taste receptor using MD simulations and network-based analysis to investigate conformational changes and structural correlations in different states. Advances understanding of bitter taste recognition mechanisms.",
    "strengths": "Novel network analysis approach; advances understanding of taste receptor function; combines computational methods effectively",
    "weaknesses": "Limited to computational approaches; focuses on single taste receptor; limited experimental validation",
    "citation": "Cannariato, M. et al. Exploring TAS2R46 biomechanics through molecular dynamics and network analysis. Front Mol Biosci 11, 1473675 (2024)",
    "problem": "Precise functioning mechanisms of TAS2R bitter taste receptors remain poorly understood",
    "assumption_challenged": "Taste receptor function cannot be understood through computational approaches alone",
    "key_insight": "Network analysis reveals global structural correlations underlying local conformational changes in taste receptors",
    "technical_approach": "Molecular dynamics simulations combined with network-based analysis of conformational dynamics",
    "impact": "Advances understanding of sensory GPCR function and provides framework for studying taste receptor mechanisms"
  },
  {
    "id": "zhang2024_adgrg2_metadynamics",
    "title": "Exploring the Binding Mechanism of ADGRG2 Through Metadynamics and Biochemical Analysis",
    "authors": "Chao Zhang, Ru Zhang, Yuanyuan Qi, et al.",
    "journal": "International Journal of Molecular Sciences", 
    "year": "2024",
    "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC11719512/",
    "hypotheses": "Metadynamics simulations can reveal binding mechanisms of adhesion GPCRs like ADGRG2",
    "notes": "Uses metadynamics simulations combined with biochemical analysis to study ADGRG2 adhesion GPCR binding mechanisms. Represents effort to understand less-studied GPCR subfamily using computational approaches.",
    "strengths": "Focuses on understudied adhesion GPCR family; combines computational and experimental approaches",
    "weaknesses": "Limited experimental validation; adhesion GPCRs may require different analytical approaches than classical GPCRs",
    "citation": "Zhang, C. et al. Exploring the Binding Mechanism of ADGRG2 Through Metadynamics and Biochemical Analysis. Int J Mol Sci 26, 167 (2024)",
    "problem": "Binding mechanisms of adhesion GPCRs are poorly understood compared to classical GPCRs",
    "assumption_challenged": "Adhesion GPCRs follow similar binding mechanisms as classical GPCRs",
    "key_insight": "Adhesion GPCRs may require specialized computational approaches to understand their unique binding mechanisms",
    "technical_approach": "Metadynamics enhanced sampling simulations combined with biochemical binding assays",
    "impact": "Advances understanding of understudied adhesion GPCR subfamily and validates computational approaches"
  },
  {
    "id": "hashem2025_biased_silico",
    "title": "Ligand-Induced Biased Activation of GPCRs: Recent Advances and New Directions from In Silico Approaches",
    "authors": "Shaima Hashem, Alexis Dougha, Pierre Tufféry",
    "journal": "Molecules",
    "year": "2025",
    "url": "https://www.mdpi.com/1420-3049/30/5/1047",
    "hypotheses": "Computational approaches can elucidate mechanisms of GPCR biased signaling and guide ligand design",
    "notes": "Review of computational methods for understanding GPCR biased signaling. Covers molecular simulations, machine learning, and AI approaches for modeling selective signaling pathways and analyzing ligand-induced bias.",
    "strengths": "Comprehensive review of computational approaches; timely focus on AI/ML methods; practical guidance for researchers",
    "weaknesses": "Review article without new experimental data; computational predictions require experimental validation",
    "citation": "Hashem, S., Dougha, A. & Tufféry, P. Ligand-Induced Biased Activation of GPCRs: Recent Advances and New Directions from In Silico Approaches. Molecules 30, 1047 (2025)",
    "problem": "Molecular mechanism of GPCR biased signaling remains elusive despite extensive research efforts",
    "assumption_challenged": "Biased signaling is too complex to understand through computational approaches",
    "key_insight": "Integration of molecular simulations with AI/ML techniques can reveal biased signaling mechanisms",
    "technical_approach": "Review of computational methods including MD simulations, enhanced sampling, and machine learning",
    "impact": "Provides roadmap for computational study of biased signaling and highlights emerging AI applications"
  },
  {
    "id": "limongelli2025_functional_dynamics",
    "title": "Functional dynamics of G protein-coupled receptors reveal new routes for drug discovery",
    "authors": "Vittorio Limongelli et al.",
    "journal": "Nature Reviews Drug Discovery", 
    "year": "2025",
    "url": "https://www.nature.com/articles/s41573-024-01083-3",
    "hypotheses": "Understanding GPCR functional dynamics reveals new druggable mechanisms beyond traditional orthosteric targeting",
    "notes": "High-impact review highlighting how advances in understanding GPCR conformational dynamics reveal new drug discovery opportunities. Focuses on allosteric modulators, biased ligands, and bivalent compounds with specific examples.",
    "strengths": "High-impact venue; integrates structural and dynamic information; practical drug discovery applications",
    "weaknesses": "Review article; focuses on retrospective analysis rather than predictive frameworks",
    "citation": "Limongelli, V. et al. Functional dynamics of G protein-coupled receptors reveal new routes for drug discovery. Nat Rev Drug Discov 24, 12-35 (2025)",
    "problem": "Traditional GPCR drug discovery focuses on orthosteric sites, limiting therapeutic options",
    "assumption_challenged": "Orthosteric binding is the primary route for GPCR drug development",
    "key_insight": "GPCR functional dynamics reveal multiple druggable mechanisms including allostery and biased signaling",
    "technical_approach": "Integration of structural biology, spectroscopy, and molecular simulations to understand dynamics",
    "impact": "Guides next-generation GPCR drug discovery toward dynamic and allosteric targeting strategies"
  },
  {
    "id": "krainer2025_single_molecule",
    "title": "Unraveling allosteric signaling of G protein-coupled receptors (GPCRs) by single-molecule fluorescence",
    "authors": "Georg Krainer et al.",
    "journal": "Biophysical Reviews",
    "year": "2025",
    "url": "https://link.springer.com/article/10.1007/s12551-025-01361-3",
    "hypotheses": "Single-molecule fluorescence techniques can reveal allosteric processes in GPCRs at unprecedented resolution",
    "notes": "Reviews application of smFRET and smPIFE techniques to study GPCR allostery. Demonstrates how single-molecule approaches reveal ligand efficacy, biased signaling, and allosteric modulation with direct evidence for conformational heterogeneity.",
    "strengths": "Cutting-edge methodology; direct observation of allosteric processes; reveals conformational heterogeneity",
    "weaknesses": "Limited to specific GPCR systems; technically challenging methodology; requires specialized instrumentation",
    "citation": "Krainer, G. et al. Unraveling allosteric signaling of G protein-coupled receptors (GPCRs) by single-molecule fluorescence. Biophys Rev 17, 123 (2025)",
    "problem": "Allosteric processes in GPCRs are difficult to study due to conformational heterogeneity and dynamic nature",
    "assumption_challenged": "Ensemble measurements are sufficient to understand GPCR allosteric mechanisms",
    "key_insight": "Single-molecule approaches reveal conformational heterogeneity and dynamic allostery invisible to ensemble methods",
    "technical_approach": "Single-molecule FRET (smFRET) and protein-induced fluorescence enhancement (smPIFE)",
    "impact": "Establishes single-molecule techniques as essential tools for understanding GPCR allostery and dynamics"
  },
  {
    "id": "xu2024_cryo_endocrine",
    "title": "Cryo-electron microscopy for GPCR research and drug discovery in endocrinology and metabolism",
    "authors": "H. Eric Xu et al.",
    "journal": "Nature Reviews Endocrinology",
    "year": "2024",
    "url": "https://www.nature.com/articles/s41574-024-00957-1",
    "hypotheses": "Cryo-EM advances enable precision medicine approaches for metabolic GPCR-targeted therapeutics",
    "notes": "Reviews impact of cryo-EM on endocrine/metabolic GPCR research. Highlights structural features, allosteric binding sites, and biased signaling with examples of glycoprotein hormone receptors and GLP-1R. Predicts 90% of human GPCRs will be structurally characterized within 5-7 years.",
    "strengths": "Focus on therapeutically relevant GPCRs; practical clinical applications; predictive timeline for field",
    "weaknesses": "Review format; limited to endocrine/metabolic GPCRs; optimistic timeline predictions",
    "citation": "Xu, H.E. et al. Cryo-electron microscopy for GPCR research and drug discovery in endocrinology and metabolism. Nat Rev Endocrinol 20, 156-170 (2024)",
    "problem": "Limited structural information for endocrine/metabolic GPCRs hampers drug discovery",
    "assumption_challenged": "GPCR structural determination is too difficult for systematic therapeutic application",
    "key_insight": "Cryo-EM revolution enables systematic structural characterization of therapeutically relevant GPCRs",
    "technical_approach": "Cryo-EM structure determination combined with pharmacological characterization",
    "impact": "Accelerates precision medicine approaches for metabolic disorders through structure-based drug design"
  },
  {
    "id": "agyemang2024_single_molecule_methods",
    "title": "Exploring GPCR conformational dynamics using single-molecule fluorescence", 
    "authors": "Eugene Agyemang, Alyssa N Gonneville, Sriram Tiruvadi-Krishnan, et al.",
    "journal": "Methods",
    "year": "2024",
    "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC11098685/",
    "hypotheses": "Single-molecule fluorescence methods can reveal GPCR conformational dynamics inaccessible to ensemble techniques",
    "notes": "Methodological review detailing single-molecule fluorescence approaches for studying GPCR conformational dynamics. Provides practical guidance for implementing smFRET and related techniques to study receptor function.",
    "strengths": "Practical methodological guidance; addresses technical challenges; enables new experimental approaches",
    "weaknesses": "Methods review without new biological insights; technically demanding approaches; limited accessibility",
    "citation": "Agyemang, E. et al. Exploring GPCR conformational dynamics using single-molecule fluorescence. Methods 226, 35-48 (2024)",
    "problem": "Ensemble methods cannot reveal conformational heterogeneity crucial for GPCR function",
    "assumption_challenged": "Bulk measurements adequately describe GPCR conformational behavior",
    "key_insight": "Single-molecule approaches reveal conformational heterogeneity and dynamics invisible to ensemble measurements", 
    "technical_approach": "Single-molecule fluorescence techniques including smFRET, smPIFE, and related methods",
    "impact": "Enables new experimental paradigms for studying GPCR dynamics and conformational heterogeneity"
  },
  {
    "id": "hildebrand2024_g_protein_coupling",
    "title": "Mechanistic insights into G-protein coupling with an agonist-bound G-protein-coupled receptor",
    "authors": "Peter W. Hildebrand et al.",
    "journal": "Nature Structural & Molecular Biology",
    "year": "2024", 
    "url": "https://www.nature.com/articles/s41594-024-01334-2",
    "hypotheses": "Molecular dynamics simulations can reveal the temporal progression of G protein coupling and GDP release",
    "notes": "MD simulations investigating β2AR-Gs coupling reveal long-range allosteric effects reducing GDP release energy. Shows signal propagation through extended receptor interface including lysine-rich motif. Describes in-plane rotation during activation.",
    "strengths": "Detailed mechanistic insights; combines simulation with experimental validation; reveals long-range allosteric effects",
    "weaknesses": "Limited to computational approach; single receptor-G protein pair; requires experimental validation of predictions",
    "citation": "Hildebrand, P.W. et al. Mechanistic insights into G-protein coupling with an agonist-bound G-protein-coupled receptor. Nat Struct Mol Biol 31, 1124-1133 (2024)",
    "problem": "Events leading to GDP ejection from Gα subunit during GPCR activation are poorly understood",
    "assumption_challenged": "G protein activation is too complex to understand at atomic detail",
    "key_insight": "GPCR-G protein coupling involves long-range allosteric effects transmitted over 30 Å to nucleotide binding site",
    "technical_approach": "Extensive molecular dynamics simulations with site-directed mutagenesis validation",
    "impact": "Reveals atomic-level mechanism of G protein activation and identifies new targets for modulating signaling"
  }
]